tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51Si1020.H
/*-----------------------------------------------------------------------------
  REG51Si1020.H

Header file for Silabs Si102x and Si103x devices.
Copyright (c) 2012 ARM Ltd and ARM Germnay GmbH.
All rights reserved.
-----------------------------------------------------------------------------*/

#ifndef __REG51Si1020_H__
#define __REG51Si1020_H__

/* Byte Registers */
/* SFRs all pages */
sfr P0          = 0x80;            /* Port 0 Latch                           */
sfr SP          = 0x81;            /* Stack Pointer                          */
sfr DPL         = 0x82;            /* Data Pointer Low                       */
sfr DPH         = 0x83;            /* Data Pointer High                      */
sfr PSBANK      = 0x84;            /* Program Space Bank Select              */
sfr SFRNEXT     = 0x85;            /* SFR Page Stack Next                    */
sfr SFRLAST     = 0x86;            /* SFR Page Stack Last                    */
sfr PCON        = 0x87;            /* Power Control                          */
sfr TCON        = 0x88;            /* Timer/Counter Control                  */
sfr PSCTL       = 0x8F;            /* Program Store R/W Control              */
sfr P1          = 0x90;            /* Port 1 Latch                           */
sfr SCON0       = 0x98;            /* UART0 Control                          */
sfr P2          = 0xA0;            /* Port 2 Latch                           */
sfr SFRPAGE     = 0xA7;            /* SFR Page                               */
sfr IE          = 0xA8;            /* Interrupt Enable                       */
sfr P3          = 0xB0;            /* Port 3 Latch                           */
sfr FLKEY       = 0xB7;            /* Flash Lock And Key                     */
sfr IP          = 0xB8;            /* Interrupt Priority                     */
sfr SMB0CN      = 0xC0;            /* SMBus0 Control                         */
sfr TMR2CN      = 0xC8;            /* Timer/Counter 2 Control                */
sfr PSW         = 0xD0;            /* Program Status Word                    */
sfr PCA0CN      = 0xD8;            /* PCA0 Control                           */
sfr ACC         = 0xE0;            /* Accumulator                            */
sfr EIE1        = 0xE6;            /* Extended Interrupt Enable 1            */
sfr EIE2        = 0xE7;            /* Extended Interrupt Enable 2            */
sfr ADC0CN      = 0xE8;            /* ADC0 Control                           */
sfr EIP1        = 0xE6;            /* Extended Interrupt 1 Priority          */
sfr EIP2        = 0xE6;            /* Extended Interrupt 2 Priority          */
sfr B           = 0xF0;            /* B Register                             */
sfr VDM0CN      = 0xFF;            /* VDD Monitor Control                    */

/* SFRs page 0x0 */
sfr TMOD        = 0x89;            /* Timer/Counter Mode                     */
sfr TL0         = 0x8A;            /* Timer/Counter 0 Low                    */
sfr TL1         = 0x8B;            /* Timer/Counter 1 Low                    */
sfr TH0         = 0x8C;            /* Timer/Counter 0 High                   */
sfr TH1         = 0x8D;            /* Timer/Counter 1 High                   */
sfr CKCON       = 0x8E;            /* Clock Control                          */
sfr TMR3CN      = 0x91;            /* Timer/Counter 3 Control                */
sfr TMR3RLL     = 0x92;            /* Timer/Counter 3 Reload Low             */
sfr TMR3RLH     = 0x93;            /* Timer/Counter 3 Reload High            */
sfr TMR3L       = 0x94;            /* Timer/Counter 3 Low                    */
sfr TMR3H       = 0x95;            /* Timer/Counter 3 High                   */
sfr SBUF0       = 0x99;            /* UART0 Data Buffer                      */
sfr CPT1CN      = 0x9A;            /* Comparator1 Control                    */
sfr CPT0CN      = 0x9B;            /* Comparator0 Control                    */
sfr CPT1MD      = 0x9C;            /* Comparator1 Mode Selection             */
sfr CPT0MD      = 0x9D;            /* Comparator0 Mode Selection             */
sfr CPT1MX      = 0x9E;            /* Comparator1 Mux Selection              */
sfr CPT0MX      = 0x9F;            /* Comparator0 Mux Selection              */
sfr SPI0CFG     = 0xA1;            /* SPI0 Configuration                     */
sfr SPI0CKR     = 0xA2;            /* SPI0 Clock Rate Control                */
sfr SPI0DAT     = 0xA3;            /* SPI0 Data                              */
sfr P0MDOUT     = 0xA4;            /* Port 0 Output Mode Configuration       */
sfr P1MDOUT     = 0xA5;            /* Port 1 Output Mode Configuration       */
sfr P2MDOUT     = 0xA6;            /* Port 2 Output Mode Configuration       */
sfr CLKSEL      = 0xA9;            /* Clock Select; Also on SFR page 0xF     */
sfr EMI0CN      = 0xAA;            /* External Memory Interface Control      */
sfr EMI0CF      = 0xAB;            /* External Memory Interface Configuration*/
sfr RTC0ADR     = 0xAC;            /* RTC0 Address                           */
sfr RTC0DAT     = 0xAD;            /* RTC0 Data                              */
sfr RTC0KEY     = 0xAE;            /* RTC0 Key                               */
sfr EMI0TC      = 0xAF;            /* External Memory Interface Timing Contr.*/
sfr OSCXCN      = 0xB1;            /* External Oscillator Control            */
sfr OSCICN      = 0xB2;            /* Internal Oscillator Control            */
sfr PMU0MD      = 0xB3;            /* Power Management Unit 0 Mode           */
sfr PMU0CF      = 0xB5;            /* Power Management Unit 0 Configuration  */
sfr PMU0FL      = 0xB6;            /* Power Management Unit Flag             */
sfr IREF0CF     = 0xB9;            /* Current Reference IREF0 Configuration  */
sfr ADC0AC      = 0xBA;            /* ADC0 Accumulator Configuration         */
sfr ADC0MX      = 0xBB;            /* ADC0 Input Channel Select              */
sfr ADC0CF      = 0xBC;            /* ADC0 Configuration                     */
sfr ADC0L       = 0xBD;            /* ADC0 Low                               */
sfr ADC0H       = 0xBE;            /* ADC0 High                              */
sfr P1MASK      = 0xBF;            /* Port 1 Mask                            */
sfr SMB0CF      = 0xC1;            /* SMBus0 Configuration                   */
sfr SMB0DAT     = 0xC2;            /* SMBus0 Data                            */
sfr ADC0GTL     = 0xC3;            /* ADC0 Greater-Than Compare Low          */
sfr ADC0GTH     = 0xC4;            /* ADC0 Greater-Than Compare High         */
sfr ADC0LTL     = 0xC5;            /* ADC0 Less-Than Compare Word Low        */
sfr ADC0LTH     = 0xC6;            /* ADC0 Less-Than Compare Word High       */
sfr P0MASK      = 0xC7;            /* Port 0 Mask                            */
sfr REG0CN      = 0xC9;            /* Voltage Regulator REG0 Control         */
sfr TMR2RLL     = 0xCA;            /* Timer/Counter 2 Reload Low             */
sfr TMR2RLH     = 0xCB;            /* Timer/Counter 2 Reload High            */
sfr TMR2L       = 0xCC;            /* Timer/Counter 2 Low                    */
sfr TMR2H       = 0xCD;            /* Timer/Counter 2 High                   */
sfr PCA0CPM5    = 0xCE;            /* PCA0 Module 5 Mode Register            */
sfr P1MAT       = 0xCF;            /* Port 1 Match                           */
sfr REF0CN      = 0xD1;            /* Voltage Reference Control              */
sfr PCA0CPL5    = 0xD2;            /* PCA0 Capture 5 Low                     */
sfr PCA0CPH5    = 0xD3;            /* PCA0 Capture 5 High                    */
sfr P0SKIP      = 0xD4;            /* Port 0 Skip                            */
sfr P1SKIP      = 0xD5;            /* Port 1 Skip                            */
sfr P2SKIP      = 0xD6;            /* Port 2 Skip                            */
sfr P0MAT       = 0xD7;            /* Port 0 Match                           */
sfr PCA0MD      = 0xD9;            /* PCA0 Mode                              */
sfr PCA0CPM0    = 0xDA;            /* PCA0 Module 0 Mode Register            */
sfr PCA0CPM1    = 0xDB;            /* PCA0 Module 1 Mode Register            */
sfr PCA0CPM2    = 0xDC;            /* PCA0 Module 2 Mode Register            */
sfr PCA0CPM3    = 0xDD;            /* PCA0 Module 3 Mode Register            */
sfr PCA0CPM4    = 0xDE;            /* PCA0 Module 4 Mode Register            */
sfr PCA0PWM     = 0xDF;            /* PCA0 PWM Configuration                 */
sfr XBR0        = 0xE1;            /* Port I/O Crossbar Control 0            */
sfr XBR1        = 0xE2;            /* Port I/O Crossbar Control 1            */
sfr XBR2        = 0xE3;            /* Port I/O Crossbar Control 2            */
sfr IT01CF      = 0xE4;            /* INT0/INT1 Configuration                */
sfr FLWR        = 0xE5;            /* Flash write only                       */
sfr PCA0CPL1    = 0xE9;            /* PCA0 Capture 1 Low                     */
sfr PCA0CPH1    = 0xEA;            /* PCA0 Capture 1 High                    */
sfr PCA0CPL2    = 0xEB;            /* PCA0 Capture 2 Low                     */
sfr PCA0CPH2    = 0xEC;            /* PCA0 Capture 2 High                    */
sfr PCA0CPL3    = 0xED;            /* PCA0 Capture 3 Low                     */
sfr PCA0CPH3    = 0xEE;            /* PCA0 Capture 3 High                    */
sfr RSTSRC      = 0xEF;            /* Reset Source Configuration/Status      */
sfr P0MDIN      = 0xF1;            /* Port 0 Input Mode Configuration        */
sfr P1MDIN      = 0xF2;            /* Port 1 Input Mode Configuration        */
sfr P2MDIN      = 0xF3;            /* Port 2 Input Mode Configuration        */
sfr SMB0ADR     = 0xF4;            /* SMBus Slave Address                    */
sfr SMB0ADM     = 0xF5;            /* SMBus Slave Address Mask               */
sfr SPI0CN      = 0xF8;            /* SPI0 Control                           */
sfr PCA0L       = 0xF9;            /* PCA0 Counter Low                       */
sfr PCA0H       = 0xFA;            /* PCA0 Counter High                      */
sfr PCA0CPL0    = 0xFB;            /* PCA0 Capture 0 Low                     */
sfr PCA0CPH0    = 0xFC;            /* PCA0 Capture 0 High                    */
sfr PCA0CPL4    = 0xFD;            /* PCA0 Capture 4 Low                     */
sfr PCA0CPH4    = 0xFE;            /* PCA0 Capture 4 High                    */

