tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51Si1020.H
/* SFRs page 0x2 */
sfr LCD0D0      = 0x89;            /* LCD0 Data 0                            */
sfr LCD0D1      = 0x8A;            /* LCD0 Data 1                            */
sfr LCD0D2      = 0x8B;            /* LCD0 Data 2                            */
sfr LCD0D3      = 0x8C;            /* LCD0 Data 3                            */
sfr LCD0D4      = 0x8D;            /* LCD0 Data 4                            */
sfr LCD0D5      = 0x8E;            /* LCD0 Data 5                            */
sfr LCD0D6      = 0x91;            /* LCD0 Data 6                            */
sfr LCD0D7      = 0x92;            /* LCD0 Data 7                            */
sfr LCD0D8      = 0x93;            /* LCD0 Data 8                            */
sfr LCD0D9      = 0x94;            /* LCD0 Data 9                            */
sfr LCD0DA      = 0x95;            /* LCD0 Data A                            */
sfr LCD0DB      = 0x96;            /* LCD0 Data B                            */
sfr LCD0DC      = 0x97;            /* LCD0 Data C                            */
sfr LCD0DD      = 0x99;            /* LCD0 Data D                            */
sfr LCD0DE      = 0x9A;            /* LCD0 Data E                            */
sfr LCD0DF      = 0x9B;            /* LCD0 Data F                            */
sfr LCD0CNTRST  = 0x9C;            /* LCD Contrast                           */
sfr LCD0CN      = 0x9D;            /* LCD Control                            */
sfr LCD0BLINK   = 0x9E;            /* LCD0 Blink Mask                        */
sfr LCD0TOGR    = 0x9F;            /* LCD0 Toggle Rate                       */
sfr SPI1CFG     = 0xA1;            /* SPI1 Configuration                     */
sfr SPI1CKR     = 0xA2;            /* SPI1 Clock Rate Control                */
sfr SPI1DAT     = 0xA3;            /* SPI0 Data                              */
sfr LCD0PWR     = 0xA4;            /* LCD0 Power                             */
sfr LCD0CF      = 0xA5;            /* LCD0 Configuration                     */
sfr LCD0VBMCN   = 0xA6;            /* LCD0 VBAT Monitor Control              */
sfr LCD0CLKDIVL = 0xA9;            /* LCD0 Clock Divider Low                 */
sfr LCD0CLKDIVH = 0xAA;            /* LCD0 Clock Divider High                */
sfr LCD0MSCN    = 0xAB;            /* LCD0 Master Control                    */
sfr LCD0MSCF    = 0xAC;            /* LCD0 Master Configuration              */
sfr LCD0CHPCF   = 0xAD;            /* LCD0 Charge Pump Configuration         */
sfr LCD0CHPMD   = 0xAE;            /* LCD0 Charge Pump Mode                  */
sfr LCD0VBMCF   = 0xAF;            /* LCD0 VBAT Monitor Configuration        */
sfr DC0CN       = 0xB1;            /* DC0 Control                            */
sfr DC0CF       = 0xB2;            /* DC0 Configuration                      */
sfr DC0MD       = 0xB3;            /* DC0 Mode                               */
sfr LCD0CHPCN   = 0xB5;            /* LCD0 Charge Pump Control               */
sfr LCD0BUFMD   = 0xB6;            /* LCD0 Buffer Mode                       */
sfr CRC1IN      = 0xB9;            /* CRC1 In                                */
sfr CRC1OUTL    = 0xBA;            /* CRC1 Out Low                           */
sfr CRC1OUTH    = 0xBB;            /* CRC1 Out High                          */
sfr CRC1POLL    = 0xBC;            /* CRC1 Polynomial Low                    */
sfr CRC1POLH    = 0xBD;            /* CRC1 Polynomial High                   */
sfr CRC1CN      = 0xBE;            /* CRC1 Control                           */
sfr PC0STAT     = 0xC1;            /* PC0 Status                             */
sfr ENC0L       = 0xC2;            /* ENC0 Data Low Byte                     */
sfr ENC0M       = 0xC3;            /* ENC0 Data Middle Byte                  */
sfr ENC0H       = 0xC4;            /* ENC0 Data High Byte                    */
sfr ENC0CN      = 0xC5;            /* ENC0 Control                           */
sfr VREGINSDL   = 0xC6;            /* Voltage Regulator Low                  */
sfr VREGINSDH   = 0xC7;            /* Voltage Regulator High                 */
sfr DMA0NCF     = 0xC9;            /* DMA Channel Configuration              */
sfr DMA0NBAL    = 0xCA;            /* DMA Memory Base Address Low            */
sfr DMA0NBAH    = 0xCB;            /* DMA Memory Base Address High           */
sfr DMA0NAOL    = 0xCC;            /* DMA Memory Address Offset Low          */
sfr DMA0NAOH    = 0xCD;            /* DMA Memory Address Offset High         */
sfr DMA0NSZL    = 0xCE;            /* DMA Transfer Size Low Byte             */
sfr DMA0NSZH    = 0xCF;            /* DMA Transfer Size High Byte            */
sfr DMA0SEL     = 0xD1;            /* DMA0 Channel Select for Configuration  */
sfr DMA0EN      = 0xD2;            /* DMA0 Channel Enable                    */
sfr DMA0INT     = 0xD3;            /* DMA0 Full-Length Interrupt             */
sfr DMA0MINT    = 0xD4;            /* DMA0 Mid-Length Interrupt              */
sfr DMA0BUSY    = 0xD5;            /* DMA0 Busy                              */
sfr DMA0NMD     = 0xD6;            /* DMA Channel Mode                       */
sfr PC0PCF      = 0xD7;            /* PC0 Mode Pull-Up Configuration         */
sfr PC0MD       = 0xD9;            /* PC0 Mode Configuration                 */
sfr PC0CTR0L    = 0xDA;            /* PC0 Counter 0 Low                      */
sfr PC0CTR0M    = 0xDB;            /* PC0 Counter 0 Middle                   */
sfr PC0CTR0H    = 0xDC;            /* PC0 Counter 0 High                     */
sfr PC0CTR1L    = 0xDD;            /* PC0 Counter 1 Low                      */
sfr PC0CTR1M    = 0xDE;            /* PC0 Counter 1 Middle                   */
sfr PC0CTR1H    = 0xDF;            /* PC0 Counter 1 High                     */
sfr PC0CMP0L    = 0xE1;            /* PC0 Comparator 0 Low                   */
sfr PC0CMP0M    = 0xE2;            /* PC0 Comparator 0 Middle                */
sfr PC0CMP0H    = 0xE3;            /* PC0 Comparator 0 High                  */
sfr PC0TH       = 0xE4;            /* PC0 Threshold                          */
sfr AES0BCFG    = 0xE9;            /* AES0 Block Configuration               */
sfr AES0DCFG    = 0xEA;            /* AES0 Data Configuration                */
sfr AES0BIN     = 0xEB;            /* AES0 Block Input                       */
sfr AES0XIN     = 0xEC;            /* AES0 XOR Input                         */
sfr AES0KIN     = 0xED;            /* AES0 Key Input                         */
sfr PC0CMP1L    = 0xF1;            /* PC0 Comparator 1 Low                   */
sfr PC0CMP1M    = 0xF2;            /* PC0 Comparator 1 Middle                */
sfr PC0CMP1H    = 0xF3;            /* PC0 Comparator 1 High                  */
sfr PC0HIST     = 0xF4;            /* PC0 History                            */
sfr AES0YOUT    = 0xF5;            /* AES Y Output                           */
sfr SPI1CN      = 0xF8;            /* SPI 1 Control                          */
sfr PC0DCL      = 0xFA;            /* PC0 Debounce Configuration Low         */
sfr PC0DCH      = 0xFB;            /* PC0 Debounce Configuration High        */
sfr PC0INT0     = 0xFC;            /* PC0 Interrupt 0                        */
sfr PC0INT1     = 0xFD;            /* PC0 Interrupt 1                        */
sfr DC0RDY      = 0xFE;            /* DC-DC Converter Ready Indicator        */

/* SFRs page 0xF */
sfr SFRPGCN     = 0x8E;            /* SFR Page Control                       */
sfr CRC0DAT     = 0x91;            /* CRC0 Data Output                       */
sfr CRC0CN      = 0x92;            /* CRC0 Control                           */
sfr CRC0IN      = 0x93;            /* CRC0 Data Input                        */
sfr CRC0FLIP    = 0x94;            /* CRC0 Bit Flip                          */
sfr CRC0AUTO    = 0x96;            /* CRC0 Automatic Control                 */
sfr CRC0CNT     = 0x97;            /* CRC0 Automatic Flash Sector Count      */
sfr LCD0BUFCN   = 0x9C;            /* LCD0 Buffer Control                    */
sfr P3DRV       = 0xA1;            /* Port 3 Drive Strength                  */
sfr P4DRV       = 0xA2;            /* Port 4 Drive Strength                  */
sfr P5DRV       = 0xA3;            /* Port 5 Drive Strength                  */
sfr P0DRV       = 0xA4;            /* Port 0 Drive Strength                  */
sfr P1DRV       = 0xA5;            /* Port 1 Drive Strength                  */
sfr P2DRV       = 0xA6;            /* Port 2 Drive Strength                  */
sfr P6DRV       = 0xAA;            /* Port 6 Drive Strength                  */
sfr P7DRV       = 0xAB;            /* Port 7 Drive Strength                  */
sfr LCD0BUFCF   = 0xAC;            /* LCD0 Buffer configuration              */
sfr P3MDOUT     = 0xB1;            /* Port 3 Output Mode                     */
sfr OSCIFL      = 0xB2;            /* Internal Oscillator Flash              */
sfr OSCICL      = 0xB3;            /* Internal Oscillator Calibration        */
sfr FLSCL       = 0xB6;            /* Flash Scale Register                   */
sfr IREF0CN     = 0xB9;            /* Current Reference IREF0 Configuration  */
sfr ADC0PWR     = 0xBA;            /* ADC0 Burst Mode Power-Up Time          */
sfr ADC0TK      = 0xBB;            /* ADC0 Tracking Control                  */
sfr TOFFL       = 0xBD;            /* Temperature Offset Low                 */
sfr TOFFH       = 0xBF;            /* Temperature Offset High                */
sfr P4          = 0xD9;            /* Port 4 Latch                           */
sfr P5          = 0xDA;            /* Port 5 Latch                           */
sfr P6          = 0xDB;            /* Port 6 Latch                           */
sfr P7          = 0xDC;            /* Port 7 Latch                           */
sfr DEVICEID    = 0xE8;            /* Device Identification                  */
sfr REVID       = 0xE9;            /* Revision Identification                */
sfr P3MDIN      = 0xF1;            /* Port 3 Input Mode Configuration        */
sfr P4MDIN      = 0xF2;            /* Port 4 Input Mode Configuration        */
sfr P5MDIN      = 0xF3;            /* Port 5 Input Mode Configuration        */
sfr P6MDIN      = 0xF4;            /* Port 6 Input Mode Configuration        */
sfr PCLKACT     = 0xF5;            /* Peripheral Clock Enable Active Mode    */
sfr P4MDOUT     = 0xF9;            /* P4 Output Mode                         */
sfr P5MDOUT     = 0xFA;            /* P5 Output Mode                         */
sfr P6MDOUT     = 0xFB;            /* P6 Output Mode                         */
sfr P7MDOUT     = 0xFC;            /* P7 Output Mode                         */
sfr CLKMODE     = 0xFD;            /* Clock Mode                             */
sfr PCLKEN      = 0xFE;            /* Peripheral Clock Enables (LP Idle)     */

